---
kind: type
id: T:Autodesk.Revit.DB.DoubleParameterValue
source: html/561ef32b-c3bc-3847-ef2a-27f4a011e650.htm
---
# Autodesk.Revit.DB.DoubleParameterValue

A class that holds a Double value of a parameter element.

## Syntax (C#)
```csharp
public class DoubleParameterValue : ParameterValue
```